{
  "backend/main.mo": "Main backend actor that manages games and videos with CRUD operations, using blob storage for images and providing query/update methods for retrieving and adding content.",
  "feature_evidence.json": "Feature evidence report mapping five main features (homepage, games showcase, videos section, about page, contact section) to their implementing files, components, and test IDs with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend files including components, pages, hooks, and configuration files for the Ryuuk Gaming application.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark modes, featuring a gaming-themed palette with neutral grays and accent colors.",
  "frontend/index.html": "HTML entry point that sets up the root div and loads the React application via main.tsx module script.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with five routes (Home, Games, Videos, About, Contact) all wrapped in a shared Layout component.",
  "frontend/src/components/Footer.tsx": "Footer component with three-column layout displaying brand info, quick navigation links, social media icons, copyright notice, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/GameCard.tsx": "Game display card showing cover image with aspect ratio 3:4, title with gamepad icon, and description with hover effects and scale transitions.",
  "frontend/src/components/Layout.tsx": "Layout wrapper providing consistent page structure with sticky Navigation header, main content area with Outlet for route rendering, and Footer.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation header with logo, desktop horizontal menu, mobile hamburger menu, and active route highlighting using TanStack Router state.",
  "frontend/src/components/SocialLinks.tsx": "Reusable component rendering YouTube, Twitch, X, and Discord social media icons with brand-specific hover colors and external link attributes.",
  "frontend/src/components/VideoCard.tsx": "Video card component displaying thumbnail with play button overlay on hover, title, description, and external link button to watch content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor for backend communication using Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGames.ts": "React Query hook that fetches all games from the backend actor, enabled only when the actor is available.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and provider component with login/logout functionality, identity management, and status tracking using DFINITY's AuthClient.",
  "frontend/src/hooks/useVideos.ts": "React Query hook that fetches all videos from the backend actor, enabled only when the actor is available.",
  "frontend/src/index.css": "Global CSS with Tailwind imports, custom CSS variables for theming (light/dark modes), custom scrollbar styling, and typography configuration using Inter and Rajdhani fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/About.tsx": "About page component displaying Ryuuk Gaming's story, mission, values, and community focus with styled sections and icons.",
  "frontend/src/pages/Contact.tsx": "Contact page component displaying social media platforms (YouTube, Twitch, X, Discord) with links and descriptions for community engagement.",
  "frontend/src/pages/Games.tsx": "Games page component that displays a grid of featured games fetched via useGames hook, with loading, error, and empty states.",
  "frontend/src/pages/Home.tsx": "Homepage component featuring a hero section with background image, call-to-action buttons for games and videos, and a features section highlighting console gaming focus, quality content, and community engagement.",
  "frontend/src/pages/Videos.tsx": "Videos page component that fetches and displays gaming videos in a grid layout with loading, error, and empty states using the useVideos hook and VideoCard component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, gaming-themed design tokens including glow effects, custom fonts (Inter and Rajdhani), and animation keyframes for accordions and pulse effects.",
  "project_state.json": "Project metadata tracking Ryuuk Gaming website features including homepage, games showcase, videos section, about section, contact/community section, and gaming-themed dark mode design with specified image requirements."
}